backend-store/app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
    def show
        @products = Product.all

INSERT INTO "products" ("title", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "www"], ["price", 222.0], ["created_at", "2021-12-06 14:36:16.714819"], ["updated_at", "2021-12-06 14:36:16.714819"]]
---
    def create
        @product = Product.new(product_params)

        if @product.save

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 11]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def deleteByid  # Vai deletar apartir do id
        Product.find(params[:id]).destroy!

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
    def findByid    # Vai buscar e retornar para o front o produto pelo id
        @product = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
UPDATE "products" SET "title" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "ESTOUAQUI"], ["updated_at", "2021-11-22 16:23:33.571640"], ["id", 26]]
---
    def updateByid
        puts '-------------------'
        @product = Product.find(params[:id])
        @product.update(product_params)