backend-store/app/controllers/products_controller.rb

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def destroyByid  # Vai deletar apartir do id
        Product.find(params[:id]).destroy!