backend-store/lib/tasks/delete_data.rake

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 2]]
---
  task all_product_table: :environment do
    Product.destroy_all