backend-store/lib/tasks/load_data_xlsx.rake

INSERT INTO "products" ("title", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "S3 Novo 16GB"], ["price", 52.89], ["created_at", "2021-12-06 13:25:04.611384"], ["updated_at", "2021-12-06 13:25:04.611384"]]
---
  task product_table: :environment do
    file = Roo::Excelx.new(Rails.root.join('spreadsheets', 'produtos.xlsx'))

    puts "Importing products.\n"
    imported_products = 0

    spreadsheet = file.sheets[0]
    first_row = file.sheet(spreadsheet).first_row
    last_row = file.sheet(spreadsheet).last_row

    break if first_row.nil?
    data_starts_at = first_row + 1
    data_finishes_at = last_row


    (data_starts_at..data_finishes_at).each_with_index do |_data|
      row = file.sheet(spreadsheet).row(_data)

      if !(row[0].nil? && row[1].nil?)
        Product.new(title: row[0], price: row[1]).save